foodlog/app/controllers/entries_controller.rb

  def index
    @entries = Entry.where("created_at >= ?", Date.today)
---
SELECT "entries".* FROM "entries" WHERE (created_at >= '2022-08-14')

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("meal_type", "calories", "proteins", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "Breakfast"], ["calories", 600], ["proteins", 23], ["carbohydrates", 50], ["fats", 10], ["created_at", "2022-08-14 10:43:27.424975"], ["updated_at", "2022-08-14 10:43:27.424975"]]

  def update
    respond_to do |format|
      if @entry.update(entry_params)
---
UPDATE "entries" SET "meal_type" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["meal_type", "u"], ["updated_at", "2022-08-14 16:33:00.023674"], ["id", 4]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 4]]